final-review-320.org
#+title: CAS CS 320 Review
#+subtitle: Principles of Programming Languages@@html:<br>@@
#+subtitle: Boston University@@html:<br>@@
#+subtitle: Spring 2023
#+HTML_LINK_HOME: material.html
#+options: H:3 toc:2
This page contains an outline of the topics covered in /CAS CS 320:
Principles of Programming Languages/ during the Spring 2023 semester.
It is not exhaustive, and is biased towards those topics which are
most pertinent for the final exam of the course.  Included are
exercises associated with each topic.
* OCaml
During the first half of the course, we learned the function
programming language [[https://ocaml.org][OCaml]].  Our primary goal was to learn how to
program in the functional style, not thinking of a function as
defining a list of commands, but instead as specifying the /shape/ of
its output.
** Basics
OCaml has many types that are standard in most programming languages,
e.g., integers, Boolean values, floating-point numbers, tuples and
lists, all with basic operators.  It also has standard functional
language constructs like let-definitions/bindings, anonymous
functions, and if-else expressions.
*** Exercises
1. Implement the function
 #+begin_src ocaml
   let matrix_of_list
     (l : 'a list)
     (num_cols : int) : ('a list list) option =
     assert false (* TODO *)
 #+end_src
 which converts a list ~l~ into a matrix with ~num_cols~ columns,
 returing ~None~ in the case that ~num_cols~ is not positive or the
 resulting matrix is not rectangular (i.e., the length of ~l~ is not
 a multiple of ~num_cols~).
2. Euclid's algorithm for determining the greatest common divisor of
 two integers is takes advantage of the fact that $\mathsf{gcd}(m, n)
 = \mathsf{gcd}(n, m \bmod n)$.  Implement the function
 #+begin_src ocaml
   let gcd (m : int) (n : int) : int =
     assert false (* TODO *)
 #+end_src
 which, given two integers ~m~ and ~n~, returns their greatest
 commond divisor.
3. We represent a rational number as a pair of integers where the
   first integer represents the numerator and the second represents
   the denominator.  We maintain the invariant that the second number
   is positive and the pair of numbers are relatively prime.
   Implement the function ~add~ which adds two rational numbers,
   making sure to maintain this invariant.
   #+begin_src ocaml
     type rat = int * int

     let add (m : rat) (n : rat) : rat =
       assert false (* TODO *)
   #+end_src
4. Implement the function
   #+begin_src ocaml
     let gen_fib : (l : int list) (n : int) : int =
       if n < 0
       then assert false
       else
         assert false (* TODO *)
   #+end_src
   which, given a list of integers ~l~ of length $k$ and a nonnegative
   integer ~n~, returns the ~n~-th element of the following sequence:
   \begin{equation*}
   F_n =
   \begin{cases}
   l[n] & n < k \\
   \sum_{i = 1}^k F_{n - i} & n \geq k
   \end{cases}
   \end{equation*}
** Algebraic Data Types
One of the most important features of a modern functional programming
language is pattern matching and algebraic data types.  An algebraic
data type (ADT) is defined by giving a collection of *constructors*,
which may themselves carry other data.  Here, for example, is an ADT
whose values represent either a Boolean values or an integers.
#+begin_src ocaml
  type bool_or_int
    = Bool of bool
    | Int of int
#+end_src
We work with values of an ADT by *pattern matching*, providing
different values depending on the /shape/ of the given value.
#+begin_src ocaml
  let num_val (x : bool_or_int) : int =
    match x with
    | Bool b -> if b then 1 else 0
    | Int i -> i
#+end_src
ADTs can be /recursive/ (the type being defined can be referred to in
the definition of the type) and /parametric/ (the type being defined
can depend parametrically on another type).  These two features are encompassed in the ~list~ type.
#+begin_src ocaml
  type 'a mylist
    = Nil
    | Cons of 'a * 'a mylist
#+end_src
*** Exercises
** Record Types
Record types are essentially tuples with named fields.
#+begin_src ocaml
  type rat =
    { numer : int
    ; denom : int
    ; is_positive : bool
    }

  let two_thirds =
    { numer = 2
    ; denom = 3
    ; is_positive = true
    }
#+end_src
Beyond this, they have a couple conveniences that are good to remember.
+ Accessing fields in a record can be done via dot notation, i.e., if
  ~r~ is a ~rat~ then ~r.is_positive~ is a ~bool~.
+ Updating a small number of fields records can be done using ~with~-notation.
   #+begin_src ocaml
     let negate (r : rat) : rat =
       { r with is_positive = not r.is_positive }

     let recip (r : rat) : rat =
       if r.numer = 0
       then assert false
       else { r with numer = r.denom; denom = r.numer }
   #+end_src
*** Exercises
1. merge user data
2. add to captured bindings
3. list of records to dictionary

