final-review-320.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-04-28 Sun 19:24 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>CAS CS 320 Review</title>
<meta name="author" content="Nathan  Mull" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="globalStyle.css">

</head>
<body>
<div id="org-div-home-and-up">⟨ <a href="material.html">home</a> ⟩</div><div id="content" class="content">
<h1 class="title">CAS CS 320 Review
<br />
<span class="subtitle">Principles of Programming Languages<br> Boston University<br> Spring 2023</span>
</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orga9f916d">OCaml</a>
<ul>
<li><a href="#orgca217ba">Basics</a></li>
<li><a href="#orge0d51e5">Algebraic Data Types</a></li>
<li><a href="#orgcedadcd">Record Types</a></li>
<li><a href="#org87ba4af">Higher-Order Programming</a></li>
<li><a href="#orgf62c214">Tail Recursion</a></li>
<li><a href="#org5863bf9">Type Checking</a></li>
</ul>
</li>
<li><a href="#orge0e9d8a">Formal Grammar</a>
<ul>
<li><a href="#orgd39b698">BNF Specifications</a></li>
<li><a href="#org5fe2548">Ambiguity</a></li>
<li><a href="#org19c5b81">Regular Grammars</a></li>
<li><a href="#org5dd135d">Chomsky Norm Form</a></li>
</ul>
</li>
<li><a href="#org6a3f72d">Parsing</a>
<ul>
<li><a href="#org9664a00">Recursive-Descent</a></li>
<li><a href="#orgf8e306b">Combinators</a></li>
</ul>
</li>
<li><a href="#orga0ae140">Formal Semantics</a>
<ul>
<li><a href="#org86d466c">Derivations</a></li>
<li><a href="#orgc963db8">Examples</a></li>
</ul>
</li>
<li><a href="#orgd08fbca">Subroutines</a>
<ul>
<li><a href="#org599e14b">Parameter Passing</a></li>
<li><a href="#org186cdf4">Examples</a></li>
</ul>
</li>
<li><a href="#org2552d76">Environments</a>
<ul>
<li><a href="#org97147b3">Stack-Oriented Language with Variables</a></li>
</ul>
</li>
<li><a href="#orge83cf98">Dynamic Scoping</a>
<ul>
<li><a href="#org629ca0b">Stack-Oriented Language with Dynamic Scoping</a></li>
</ul>
</li>
<li><a href="#orgbc1fe25">Lexical Scoping</a>
<ul>
<li><a href="#orgf4a1425">Activation Records</a></li>
<li><a href="#org6e9edfe">Closures</a></li>
</ul>
</li>
<li><a href="#org6047722">Compilation</a></li>
<li><a href="#org54d3a2a">Solutions to Exercises</a></li>
</ul>
</div>
</div>
<p>
This page contains an outline of the topics covered in <i>CAS CS 320:
Principles of Programming Languages</i> during the Spring 2023 semester.
It is not exhaustive, and is biased towards those topics which are
most pertinent for the final exam of the course.  Included are
exercises associated with each topic.
</p>
<div id="outline-container-orga9f916d" class="outline-2">
<h2 id="orga9f916d">OCaml</h2>
<div class="outline-text-2" id="text-orga9f916d">
<p>
During the first half of the course, we learned the function
programming language <a href="https://ocaml.org">OCaml</a>.  Our primary goal was to learn how to
program in the functional style, not thinking of a function as
defining a list of commands, but instead as specifying the <i>shape</i> of
its output.
</p>
</div>
<div id="outline-container-orgca217ba" class="outline-3">
<h3 id="orgca217ba">Basics</h3>
<div class="outline-text-3" id="text-orgca217ba">
<p>
OCaml has many types that are standard in most programming languages,
e.g., integers, Boolean values, floating-point numbers, tuples and
lists, all with basic operators.  It also has standard functional
language constructs like let-definitions/bindings, anonymous
functions, and if-else expressions.
</p>
</div>
<div id="outline-container-org5f50e95" class="outline-4">
<h4 id="org5f50e95">Exercises</h4>
<div class="outline-text-4" id="text-org5f50e95">
<ol class="org-ol">
<li><p>
Implement the function
</p>
<div class="org-src-container">
<pre class="src src-ocaml">let matrix_of_list
  (l : 'a list)
  (num_cols : int) : ('a list list) option =
  assert false (* TODO *)
</pre>
</div>
<p>
which converts a list <code>l</code> into a matrix with <code>num_cols</code> columns,
returing <code>None</code> in the case that <code>num_cols</code> is not positive or the
resulting matrix is not rectangular (i.e., the length of <code>l</code> is not
a multiple of <code>num_cols</code>).
</p></li>
<li><p>
Euclid's algorithm for determining the greatest common divisor of
two integers is takes advantage of the fact that \(\mathsf{gcd}(m, n)
 = \mathsf{gcd}(n, m \bmod n)\).  Implement the function
</p>
<div class="org-src-container">
<pre class="src src-ocaml">let gcd (m : int) (n : int) : int =
  assert false (* TODO *)
</pre>
</div>
<p>
which, given two integers <code>m</code> and <code>n</code>, returns their greatest
commond divisor.
</p></li>
<li><p>
We represent a rational number as a pair of integers where the
first integer represents the numerator and the second represents
the denominator.  We maintain the invariant that the second number
is positive and the pair of numbers are relatively prime.
Implement the function <code>add</code> which adds two rational numbers,
making sure to maintain this invariant.
</p>
<div class="org-src-container">
<pre class="src src-ocaml">type rat = int * int

let add (m : rat) (n : rat) : rat =
  assert false (* TODO *)
</pre>
</div></li>
<li><p>
Implement the function
</p>
<div class="org-src-container">
<pre class="src src-ocaml">let gen_fib : (l : int list) (n : int) : int =
  if n &lt; 0
  then assert false
  else
    assert false (* TODO *)
</pre>
</div>
<p>
which, given a list of integers <code>l</code> of length \(k\) and a nonnegative
integer <code>n</code>, returns the <code>n</code>-th element of the following sequence:
</p>
\begin{equation*}
F_n =
\begin{cases}
l[n] & n < k \\
\sum_{i = 1}^k F_{n - i} & n \geq k
\end{cases}
\end{equation*}</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orge0d51e5" class="outline-3">
<h3 id="orge0d51e5">Algebraic Data Types</h3>
<div class="outline-text-3" id="text-orge0d51e5">
<p>
One of the most important features of a modern functional programming
language is pattern matching and algebraic data types.  An algebraic
data type (ADT) is defined by giving a collection of <b>constructors</b>,
which may themselves carry other data.  Here, for example, is an ADT
whose values represent either a Boolean values or an integers.
</p>
<div class="org-src-container">
<pre class="src src-ocaml">type bool_or_int
  = Bool of bool
  | Int of int
</pre>
</div>
<p>
We work with values of an ADT by <b>pattern matching</b>, providing
different values depending on the <i>shape</i> of the given value.
</p>
<div class="org-src-container">
<pre class="src src-ocaml">let num_val (x : bool_or_int) : int =
  match x with
  | Bool b -&gt; if b then 1 else 0
  | Int i -&gt; i
</pre>
</div>
<p>
ADTs can be <i>recursive</i> (the type being defined can be referred to in
the definition of the type) and <i>parametric</i> (the type being defined
can depend parametrically on another type).  These two features are encompassed in the <code>list</code> type.
</p>
<div class="org-src-container">
<pre class="src src-ocaml">type 'a mylist
  = Nil
  | Cons of 'a * 'a mylist
</pre>
</div>
</div>
<div id="outline-container-orgcaa61e5" class="outline-4">
<h4 id="orgcaa61e5">Exercises</h4>
</div>
</div>
<div id="outline-container-orgcedadcd" class="outline-3">
<h3 id="orgcedadcd">Record Types</h3>
<div class="outline-text-3" id="text-orgcedadcd">
<p>
Record types are essentially tuples with named fields.
</p>
<div class="org-src-container">
<pre class="src src-ocaml">type rat =
  { numer : int
  ; denom : int
  ; is_positive : bool
  }

let two_thirds =
  { numer = 2
  ; denom = 3
  ; is_positive = true
  }
</pre>
</div>
<p>
Beyond this, they have a couple conveniences that are good to remember.
</p>
<ul class="org-ul">
<li>Accessing fields in a record can be done via dot notation, i.e., if
<code>r</code> is a <code>rat</code> then <code>r.is_positive</code> is a <code>bool</code>.</li>
<li><p>
Updating a small number of fields records can be done using <code>with</code>-notation.
</p>
<div class="org-src-container">
<pre class="src src-ocaml">let negate (r : rat) : rat =
  { r with is_positive = not r.is_positive }

let recip (r : rat) : rat =
  if r.numer = 0
  then assert false
  else { r with numer = r.denom; denom = r.numer }
</pre>
</div></li>
</ul>
</div>
<div id="outline-container-orgee27efa" class="outline-4">
<h4 id="orgee27efa">Exercises</h4>
<div class="outline-text-4" id="text-orgee27efa">
<ol class="org-ol">
<li>merge user data</li>
<li>add to captured bindings</li>
<li>list of records to dictionary</li>
</ol>
</div>
</div>
</div>
