final-review-320.org
** Higher-Order Programming
Higher-order programming is the use of functions as first-class values
to write general, reusable code.  There are three patterns in
particular for higher-order programming with lists which we looked at
in depth.
+ The function ~map~, defined as
  #+begin_src ocaml
    let rec map (f : 'a -> 'b) (l : 'a list) : 'b list =
      match l with
      | [] -> []
      | x :: l -> let x = f x in x :: map f l
  #+end_src
  replaces each element in ~l~ with ~f~ applied to that element, in
  order from left to right.
+ The function ~filter~, defined as
  #+begin_src ocaml
    let rec filter (p : 'a -> bool) (l : 'a list) : 'a list =
      match l with
      | [] -> []
      | x :: l -> if p x then x :: filter p l else filter p l
  #+end_src
  find all element of ~l~ which satisfy the predicate ~p~, in order
  from left to right.
+ The function ~fold_right~, defined as
  #+begin_src ocaml
    let rec fold_right (f : 'a -> 'b -> 'b) (l : 'a list) (accu : 'b) : 'b =
      match l with
      | [] -> accu
      | x :: l -> f x (fold_right f l accu)
  #+end_src
  applies the binary operation ~f~ between every element of ~l @ [accu]~ right-associatively:
  #+begin_src
     [x1;   x2;   x3; ...   xn]
      ↓↓    ↓↓    ↓↓        ↓↓
    f x1 (f x2 (f x3 (...(f xn accu)...)))
  #+end_src
  The function ~fold_left~ does the same but to ~accu :: l~  left-associatively:
  #+begin_src ocaml
    let rec fold_left (f : 'b -> 'a -> 'b) (accu : 'b) (l : 'a list) : 'b =
      match l with
      | [] -> accu
      | x :: l -> fold_left f (f accu x) l
  #+end_src
  #+begin_src
                       [x1; x2; x3; ... xn]
                        ↓↓  ↓↓  ↓↓      ↓↓
    f (...(f (f (f accu x1) x2) x3)...) xn
  #+end_src
*** Exercises
1. predicate operations
2. find the derivative (newtons)
3. radix sort bucketing as fold_left
** Tail Recursion
Roughly speaking, a recursive call in the body of a function
definition is in *tail position* if no evaluation is required /after/
the recursive call.  The following implementation of the factorial
function is not tail recursive because it requires evaluating the
product of the result of its recursive call with the input ~n~.
#+begin_src ocaml
  let rec factorial (n : int) : int =
    if n < 0
    then assert false
    else if n = 0
    then 1
    else n * factorial n
#+end_src
We tend to make functions tail recursive by adding an accumulator argument to the function.
#+begin_src ocaml
  let factorial_tail (n : int) : int =
    let rec go (n : int) (accu : int) =
      if n = 0
      then accu
      else go (n - 1) (n * accu)
    in
    if n < 0
    then assert false
    else go n 1
#+end_src
*** Exercises
1. hour glass + tr hour glass
2. tr evaluator
** Type Checking
OCaml is strongly typed, and it is statically checked for adherence to
typing rules.  OCaml also has type inference, which means we often do
not have to specify the types of expressions in OCaml programs (though
it can be useful for documentation purposes).
*** Exercises
1. What is the type of this?
2. Does this type check?
* Formal Grammar
In general, grammar is the study of the form structure of language.
We use concepts from the study of formal grammar to represent and
reason about the syntax of programming languages.  These concepts
inform the design of parsers.
** BNF Specifications
We start with a collection of symbols, separated into to disjoint
groups, the *nonterminal* symbols and the *terminal* symbols.  In a
Backus-Naur Form (BNF) specification we use notation like ~<nonterm>~
to denote a nonterminal symbols.  We typically don't specify the
symbols in advance, but instead glean then from the specification
itself.

*** Definitions
A *sentential form* is a sequences of symbols and a *sentence* is a
sequence of terminal symbols.

A *production rule* is made up of a nonterminal symbol and a
sentential form, and is written
#+begin_src
  <nonterm> ::= SENTFORM
#+end_src
We interpret a production rule as indicating that ~<nonterm>~ /stands
for/ ~SENTFORM~ in a sentence.

A *BNF specification* is given by a collection of production rules and
a *starting symbol*.  We typically take the nonterminal symbol in the
/first/ rule of the specification to be the starting symbol.

A *derivation* of a sentential form $S$ in a specification $\mathcal
B$ with start symbol ~<start>~ is a sequence of sentential forms,
starting with the start symbol ~<start>~ and ending in $S$, in which
each form in the sequence (except for ~<start>~) is the results of
replacing a nonterminal symbol in the previous form with a sentential
from given by a production rule in $\mathcal B$.

A derivation is *leftmost* if the nonterminal symbol replaced at each
step of the derivation is the leftmost nonterminal symbol in the
sentential form.

A *parse tree*, informally, is a derivation represented as a tree, in
which the root is labeled with the starting symbol and each node
contains as it's children the symbols of sentential form which it is
replaced with in the derivation. A parse tree may correspond to
multiple derivations, but every derivation has a unique parse tree
representation.

*** Examples
TODO
*** Exercises
1. List the symbols implicit in this specification.
2. Give a derivation of S in this grammar.
3. Give a leftmost derivation of S in this grammar.
4. Give an example of a grammar with no leftmost derivations.
5. Draw the parse tree associated with this derivation.
6. Draw the parse tree for this sentence in this grammar.
7. Implement the algorithm which determines the sentence for a given
   parse_tree.
** Ambiguity
A BNF specification is *ambiguous* if there is a sentence with
multiple parse trees.  We try to avoid ambiguous specifications for
programming languages because we don't want a program to be
interpretable in multiple ways.

