final-review-320.html

<div id="outline-container-org87ba4af" class="outline-3">
<h3 id="org87ba4af">Higher-Order Programming</h3>
<div class="outline-text-3" id="text-org87ba4af">
<p>
Higher-order programming is the use of functions as first-class values
to write general, reusable code.  There are three patterns in
particular for higher-order programming with lists which we looked at
in depth.
</p>
<ul class="org-ul">
<li><p>
The function <code>map</code>, defined as
</p>
<div class="org-src-container">
<pre class="src src-ocaml">let rec map (f : 'a -&gt; 'b) (l : 'a list) : 'b list =
  match l with
  | [] -&gt; []
  | x :: l -&gt; let x = f x in x :: map f l
</pre>
</div>
<p>
replaces each element in <code>l</code> with <code>f</code> applied to that element, in
order from left to right.
</p></li>
<li><p>
The function <code>filter</code>, defined as
</p>
<div class="org-src-container">
<pre class="src src-ocaml">let rec filter (p : 'a -&gt; bool) (l : 'a list) : 'a list =
  match l with
  | [] -&gt; []
  | x :: l -&gt; if p x then x :: filter p l else filter p l
</pre>
</div>
<p>
find all element of <code>l</code> which satisfy the predicate <code>p</code>, in order
from left to right.
</p></li>
<li><p>
The function <code>fold_right</code>, defined as
</p>
<div class="org-src-container">
<pre class="src src-ocaml">let rec fold_right (f : 'a -&gt; 'b -&gt; 'b) (l : 'a list) (accu : 'b) : 'b =
  match l with
  | [] -&gt; accu
  | x :: l -&gt; f x (fold_right f l accu)
</pre>
</div>
<p>
applies the binary operation <code>f</code> between every element of <code>l @ [accu]</code> right-associatively:
</p>
<pre class="example">
 [x1;   x2;   x3; ...   xn]
  ↓↓    ↓↓    ↓↓        ↓↓
f x1 (f x2 (f x3 (...(f xn accu)...)))
</pre>
<p>
The function <code>fold_left</code> does the same but to <code>accu :: l</code>  left-associatively:
</p>
<div class="org-src-container">
<pre class="src src-ocaml">let rec fold_left (f : 'b -&gt; 'a -&gt; 'b) (accu : 'b) (l : 'a list) : 'b =
  match l with
  | [] -&gt; accu
  | x :: l -&gt; fold_left f (f accu x) l
</pre>
</div>
<pre class="example">
                   [x1; x2; x3; ... xn]
                    ↓↓  ↓↓  ↓↓      ↓↓
f (...(f (f (f accu x1) x2) x3)...) xn
</pre></li>
</ul>
</div>
<div id="outline-container-orgdc8df56" class="outline-4">
<h4 id="orgdc8df56">Exercises</h4>
<div class="outline-text-4" id="text-orgdc8df56">
<ol class="org-ol">
<li>predicate operations</li>
<li>find the derivative (newtons)</li>
<li>radix sort bucketing as fold<sub>left</sub></li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orgf62c214" class="outline-3">
<h3 id="orgf62c214">Tail Recursion</h3>
<div class="outline-text-3" id="text-orgf62c214">
<p>
Roughly speaking, a recursive call in the body of a function
definition is in <b>tail position</b> if no evaluation is required <i>after</i>
the recursive call.  The following implementation of the factorial
function is not tail recursive because it requires evaluating the
product of the result of its recursive call with the input <code>n</code>.
</p>
<div class="org-src-container">
<pre class="src src-ocaml">let rec factorial (n : int) : int =
  if n &lt; 0
  then assert false
  else if n = 0
  then 1
  else n * factorial n
</pre>
</div>
<p>
We tend to make functions tail recursive by adding an accumulator argument to the function.
</p>
<div class="org-src-container">
<pre class="src src-ocaml">let factorial_tail (n : int) : int =
  let rec go (n : int) (accu : int) =
    if n = 0
    then accu
    else go (n - 1) (n * accu)
  in
  if n &lt; 0
  then assert false
  else go n 1
</pre>
</div>
</div>
<div id="outline-container-orgbe45995" class="outline-4">
<h4 id="orgbe45995">Exercises</h4>
<div class="outline-text-4" id="text-orgbe45995">
<ol class="org-ol">
<li>hour glass + tr hour glass</li>
<li>tr evaluator</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org5863bf9" class="outline-3">
<h3 id="org5863bf9">Type Checking</h3>
<div class="outline-text-3" id="text-org5863bf9">
<p>
OCaml is strongly typed, and it is statically checked for adherence to
typing rules.  OCaml also has type inference, which means we often do
not have to specify the types of expressions in OCaml programs (though
it can be useful for documentation purposes).
</p>
</div>
<div id="outline-container-org99613af" class="outline-4">
<h4 id="org99613af">Exercises</h4>
<div class="outline-text-4" id="text-org99613af">
<ol class="org-ol">
<li>What is the type of this?</li>
<li>Does this type check?</li>
</ol>
</div>
</div>
</div>
</div>
<div id="outline-container-orge0e9d8a" class="outline-2">
<h2 id="orge0e9d8a">Formal Grammar</h2>
<div class="outline-text-2" id="text-orge0e9d8a">
<p>
In general, grammar is the study of the form structure of language.
We use concepts from the study of formal grammar to represent and
reason about the syntax of programming languages.  These concepts
inform the design of parsers.
</p>
</div>
<div id="outline-container-orgd39b698" class="outline-3">
<h3 id="orgd39b698">BNF Specifications</h3>
<div class="outline-text-3" id="text-orgd39b698">
<p>
We start with a collection of symbols, separated into to disjoint
groups, the <b>nonterminal</b> symbols and the <b>terminal</b> symbols.  In a
Backus-Naur Form (BNF) specification we use notation like <code>&lt;nonterm&gt;</code>
to denote a nonterminal symbols.  We typically don't specify the
symbols in advance, but instead glean then from the specification
itself.
</p>
</div>

<div id="outline-container-orgc50954e" class="outline-4">
<h4 id="orgc50954e">Definitions</h4>
<div class="outline-text-4" id="text-orgc50954e">
<p>
A <b>sentential form</b> is a sequences of symbols and a <b>sentence</b> is a
sequence of terminal symbols.
</p>

<p>
A <b>production rule</b> is made up of a nonterminal symbol and a
sentential form, and is written
</p>
<pre class="example">
&lt;nonterm&gt; ::= SENTFORM
</pre>
<p>
We interpret a production rule as indicating that <code>&lt;nonterm&gt;</code> <i>stands
for</i> <code>SENTFORM</code> in a sentence.
</p>

<p>
A <b>BNF specification</b> is given by a collection of production rules and
a <b>starting symbol</b>.  We typically take the nonterminal symbol in the
<i>first</i> rule of the specification to be the starting symbol.
</p>

<p>
A <b>derivation</b> of a sentential form \(S\) in a specification \(\mathcal
B\) with start symbol <code>&lt;start&gt;</code> is a sequence of sentential forms,
starting with the start symbol <code>&lt;start&gt;</code> and ending in \(S\), in which
each form in the sequence (except for <code>&lt;start&gt;</code>) is the results of
replacing a nonterminal symbol in the previous form with a sentential
from given by a production rule in \(\mathcal B\).
</p>

<p>
A derivation is <b>leftmost</b> if the nonterminal symbol replaced at each
step of the derivation is the leftmost nonterminal symbol in the
sentential form.
</p>

<p>
A <b>parse tree</b>, informally, is a derivation represented as a tree, in
which the root is labeled with the starting symbol and each node
contains as it's children the symbols of sentential form which it is
replaced with in the derivation. A parse tree may correspond to
multiple derivations, but every derivation has a unique parse tree
representation.
</p>
</div>
</div>

<div id="outline-container-orga7b93a9" class="outline-4">
<h4 id="orga7b93a9">Examples</h4>
<div class="outline-text-4" id="text-orga7b93a9">
<p>
TODO
</p>
</div>
</div>
<div id="outline-container-org028c409" class="outline-4">
<h4 id="org028c409">Exercises</h4>
<div class="outline-text-4" id="text-org028c409">
<ol class="org-ol">
<li>List the symbols implicit in this specification.</li>
<li>Give a derivation of S in this grammar.</li>
<li>Give a leftmost derivation of S in this grammar.</li>
<li>Give an example of a grammar with no leftmost derivations.</li>
<li>Draw the parse tree associated with this derivation.</li>
<li>Draw the parse tree for this sentence in this grammar.</li>
<li>Implement the algorithm which determines the sentence for a given
parse<sub>tree</sub>.</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org5fe2548" class="outline-3">
<h3 id="org5fe2548">Ambiguity</h3>
<div class="outline-text-3" id="text-org5fe2548">
<p>
A BNF specification is <b>ambiguous</b> if there is a sentence with
multiple parse trees.  We try to avoid ambiguous specifications for
programming languages because we don't want a program to be
interpretable in multiple ways.
</p>
</div>
