final-review-320.org
*** Fixity

The *fixity* of an operator refers to where the operator is written
with respect to its arguments.
+ *prefix* operators appear /before/ their argument
  + the negation operator: ~-5~
+ *postfix* operators appear /after/ their argument
  + type constructors: ~int list~
+ *infix* (binary) operators appear /between/ their arguments
  + arithmetic operators: ~(1 + 2) * (3 + 4)~)
+ *mixfix* operators are a combination of these
  + if-else-expressions: ~if not b the f x else g x~

One of the primary ways in which specifications of programming
languages can be ambiguous is in the use of infix and mixfix
operations.  If a language's syntactic constructs are all prefix
(Polish notation) or all postfix (reverse Polish notation) then the
specification is unambiguous.

We can make infix binary operators unambiguous by specifying their
associativity and precedence.
*** Associativity
An operator $\square$ is declared *left associative* if we interpret
$a \square b \square c$ to be equivalent to $(a \square b) \square c$.
+ For arithmetic expressions, we take subtraction to be
  left-associative, so the expression ~1 - 2 - 3~ evaluates to ~-4~
  as opposed to ~2~.

An operator $\square$ is declared *right associative* if we interpret
$a \square b \square c$ to be equivalent to $a \square (b \square c)$.
+ For arithmetic expressions, we take exponentiation to be
  right-associative, so the expression ~2 ^ 1 ^ 3~ evaluates to ~2~
  as opposed to ~8~.

We can enforce the associativity of an operator in the specification itself.
*** Precedence
Given two binary operators $\square$ and $\triangle$, the operator
$\square$ has *higher precedence* than $\triangle$ if we interpret $a
\square b \triangle c$ as $(a \square b) \triangle c$ and $a \triangle
b \square c$ as $a \triangle (b \square c)$.
+ For arithmetic expressions, we take multiplication to have higher
  precedence than addition, so the expression ~2 * 2 + 3~ evaluates to
  ~7~ as opposed to ~10~.

As with associativity, we can enforce precedence within the
specification itself.

TODO
*** Exercises
1. Is this grammar ambiguous?
2. Find a sentence in this grammar which has multiple derivations.
3. Update this grammar so that it makes the operations precedence and hold
** Regular Grammars
Regular grammars are a special form of grammar.

Regular expressions are a compact representation of regular grammars.
** Chomsky Norm Form
TODO
* Parsing
The general parsing problem is to find a derivation of a sentence, if
one exists.  (NOTE ON CHOMSKY)

In the context of this course, we are more interested in the specific
problem of converting a string representation of a program into an
algebraic data type representing the syntax of the program.

There are many ways to accomplish this, we saw two.

** Recursive-Descent

Recursive-descent parsing refers to an ad-hoc form of parsing in which
mutually recursive functions are defined to parse forms of a
specification.

This is best understood by example.

TODO

(Note: It is unlikely that recursive-descent parsing will appear on
the final exam in any significant way.)

** Combinators

We can think of a parser for ~'a~'s as a functions of type
#+begin_src ocaml
  type 'a parser = char list -> ('a * char list) option
#+end_src
which
1. consumes the prefix of the input stream corresponding to an ~'a~,
2. converts that prefix to an ~'a~, and finally,
3. returns that ~'a~ and the remainder of the stream, failing if no
   initial part of the stream corresponds to an ~'a~.

One of the simplest examples is the ~char~ parser:
#+begin_src ocaml
  let char (d : char) (cs : char list) : (char * char list) option =
    match cs with
    | c :: cs when c = d -> Some (d, cs)
    | _ -> None
#+end_src
which consumes the first character of ~cs~ given that it is equal to
~d~ and returns it, along with the remainder of ~cs~.  This parser
fails (returns ~None~) in the case that the first character of ~cs~ is
not ~d~.

When we want to /use/ a parser, we apply it to a character list and
verify that it consumed it's the entire input:
#+begin_src ocaml
  let parse (p : 'a parser) (s : string) =
    match p (explode s) with
    | (a, []) -> Some a
    | _ -> None
#+end_src

A *parser combinator* is a higher-order function which can be used to
compose parsers. There is a small subset of parser combinators which
are of particular importance because they correspond to the constructs
in EBNF specifications.
+ *Alternatives.* ~p1 <|> p2~ is the parser which tries running the
  parser ~p1~, returning its output if it succeeds, and running ~p2~
  otherwise.

  If ~p1~ is a parser for the forms of a nonterminal symbol ~<p1>~
  and ~p2~ a parser for forms of a nonterminal symbol ~<p2>~, then ~p1
  <|> p2~ is a parser for forms of the nonterminal symbol
  #+begin_src
    <alt> ::= <p1> | <p2>
  #+end_src
+ *Sequencing.* ~seq p1 p2~ is the parser which runs both ~p1~ and
  ~p2~ and returns both of their outputs if both parsers succeed.  It
  fails if either ~p1~ or ~p2~ fails.

  If ~p1~ is a parser for the forms of a nonterminal symbol ~<p1>~ and
  ~p2~ a parser for forms of a nonterminal symbol ~<p2>~, then ~p1 <|>
  p2~ is a parser for forms of the nonterminal symbol
  #+begin_src
    <seq> ::= <p1> <p2>
  #+end_src
+ *Repetition.* ~many p~ is the parser which runs ~p~ repeatedly until
  it fails, collecting all its outputs in a list.

  If ~p~ is a parser for the forms of a nonterminal symbol ~<p>~ and
  ~p2~ a parser for forms of a nonterminal symbol ~<p2>~, then ~many
  p~ is a parser for forms of the nonterminal symbol
  #+begin_src
    <many> ::= { <p> }
  #+end_src

The last important combinator is ~map~, which can be used to
manipulate the output of a parser without affecting how it consumes
its input.  If ~p~ is an ~'a parser~, and ~f~ is a function of type
~'a -> 'b~, then ~map f p~ is a ~'b parser~ which runs ~'a~ and then
applies ~f~ to its output (if it succeeds).

You should also be familiar with how to use the more convenient parser
combinators throughout the course (though, for the exam, you will not
be required to memorize their definitions).
+ ~str~, ~token~, ~ws~
+ (~>>~), (~<<~), ~seq3~, ~seq4~
+ (~>|~), ~map2~, ~map3~, ~map4~
+ ~pure~, ~fail~, (we will not test on ~bind~ (~>>=~) but it is good to know...)


*** Exercises
