final-review-320.html

<div id="outline-container-org26d040f" class="outline-4">
<h4 id="org26d040f">Fixity</h4>
<div class="outline-text-4" id="text-org26d040f">
<p>
The <b>fixity</b> of an operator refers to where the operator is written
with respect to its arguments.
</p>
<ul class="org-ul">
<li><b>prefix</b> operators appear <i>before</i> their argument
<ul class="org-ul">
<li>the negation operator: <code>-5</code></li>
</ul></li>
<li><b>postfix</b> operators appear <i>after</i> their argument
<ul class="org-ul">
<li>type constructors: <code>int list</code></li>
</ul></li>
<li><b>infix</b> (binary) operators appear <i>between</i> their arguments
<ul class="org-ul">
<li>arithmetic operators: <code>(1 + 2) * (3 + 4)</code>)</li>
</ul></li>
<li><b>mixfix</b> operators are a combination of these
<ul class="org-ul">
<li>if-else-expressions: <code>if not b the f x else g x</code></li>
</ul></li>
</ul>

<p>
One of the primary ways in which specifications of programming
languages can be ambiguous is in the use of infix and mixfix
operations.  If a language's syntactic constructs are all prefix
(Polish notation) or all postfix (reverse Polish notation) then the
specification is unambiguous.
</p>

<p>
We can make infix binary operators unambiguous by specifying their
associativity and precedence.
</p>
</div>
</div>
<div id="outline-container-org20af429" class="outline-4">
<h4 id="org20af429">Associativity</h4>
<div class="outline-text-4" id="text-org20af429">
<p>
An operator \(\square\) is declared <b>left associative</b> if we interpret
\(a \square b \square c\) to be equivalent to \((a \square b) \square c\).
</p>
<ul class="org-ul">
<li>For arithmetic expressions, we take subtraction to be
left-associative, so the expression <code>1 - 2 - 3</code> evaluates to <code>-4</code>
as opposed to <code>2</code>.</li>
</ul>

<p>
An operator \(\square\) is declared <b>right associative</b> if we interpret
\(a \square b \square c\) to be equivalent to \(a \square (b \square c)\).
</p>
<ul class="org-ul">
<li>For arithmetic expressions, we take exponentiation to be
right-associative, so the expression <code>2 ^ 1 ^ 3</code> evaluates to <code>2</code>
as opposed to <code>8</code>.</li>
</ul>

<p>
We can enforce the associativity of an operator in the specification itself.
</p>
</div>
</div>
<div id="outline-container-org4934e3c" class="outline-4">
<h4 id="org4934e3c">Precedence</h4>
<div class="outline-text-4" id="text-org4934e3c">
<p>
Given two binary operators \(\square\) and \(\triangle\), the operator
\(\square\) has <b>higher precedence</b> than \(\triangle\) if we interpret \(a
\square b \triangle c\) as \((a \square b) \triangle c\) and \(a \triangle
b \square c\) as \(a \triangle (b \square c)\).
</p>
<ul class="org-ul">
<li>For arithmetic expressions, we take multiplication to have higher
precedence than addition, so the expression <code>2 * 2 + 3</code> evaluates to
<code>7</code> as opposed to <code>10</code>.</li>
</ul>

<p>
As with associativity, we can enforce precedence within the
specification itself.
</p>

<p>
TODO
</p>
</div>
</div>
<div id="outline-container-org0adfa3c" class="outline-4">
<h4 id="org0adfa3c">Exercises</h4>
<div class="outline-text-4" id="text-org0adfa3c">
<ol class="org-ol">
<li>Is this grammar ambiguous?</li>
<li>Find a sentence in this grammar which has multiple derivations.</li>
<li>Update this grammar so that it makes the operations precedence and hold</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org19c5b81" class="outline-3">
<h3 id="org19c5b81">Regular Grammars</h3>
<div class="outline-text-3" id="text-org19c5b81">
<p>
Regular grammars are a special form of grammar.
</p>

<p>
Regular expressions are a compact representation of regular grammars.
</p>
</div>
</div>
<div id="outline-container-org5dd135d" class="outline-3">
<h3 id="org5dd135d">Chomsky Norm Form</h3>
<div class="outline-text-3" id="text-org5dd135d">
<p>
TODO
</p>
</div>
</div>
</div>
<div id="outline-container-org6a3f72d" class="outline-2">
<h2 id="org6a3f72d">Parsing</h2>
<div class="outline-text-2" id="text-org6a3f72d">
<p>
The general parsing problem is to find a derivation of a sentence, if
one exists.  (NOTE ON CHOMSKY)
</p>

<p>
In the context of this course, we are more interested in the specific
problem of converting a string representation of a program into an
algebraic data type representing the syntax of the program.
</p>

<p>
There are many ways to accomplish this, we saw two.
</p>
</div>

<div id="outline-container-org9664a00" class="outline-3">
<h3 id="org9664a00">Recursive-Descent</h3>
<div class="outline-text-3" id="text-org9664a00">
<p>
Recursive-descent parsing refers to an ad-hoc form of parsing in which
mutually recursive functions are defined to parse forms of a
specification.
</p>

<p>
This is best understood by example.
</p>

<p>
TODO
</p>

<p>
(Note: It is unlikely that recursive-descent parsing will appear on
the final exam in any significant way.)
</p>
</div>
</div>

<div id="outline-container-orgf8e306b" class="outline-3">
<h3 id="orgf8e306b">Combinators</h3>
<div class="outline-text-3" id="text-orgf8e306b">
<p>
We can think of a parser for <code>'a</code>'s as a functions of type
</p>
<div class="org-src-container">
<pre class="src src-ocaml">type 'a parser = char list -&gt; ('a * char list) option
</pre>
</div>
<p>
which
</p>
<ol class="org-ol">
<li>consumes the prefix of the input stream corresponding to an <code>'a</code>,</li>
<li>converts that prefix to an <code>'a</code>, and finally,</li>
<li>returns that <code>'a</code> and the remainder of the stream, failing if no
initial part of the stream corresponds to an <code>'a</code>.</li>
</ol>

<p>
One of the simplest examples is the <code>char</code> parser:
</p>
<div class="org-src-container">
<pre class="src src-ocaml">let char (d : char) (cs : char list) : (char * char list) option =
  match cs with
  | c :: cs when c = d -&gt; Some (d, cs)
  | _ -&gt; None
</pre>
</div>
<p>
which consumes the first character of <code>cs</code> given that it is equal to
<code>d</code> and returns it, along with the remainder of <code>cs</code>.  This parser
fails (returns <code>None</code>) in the case that the first character of <code>cs</code> is
not <code>d</code>.
</p>

<p>
When we want to <i>use</i> a parser, we apply it to a character list and
verify that it consumed it's the entire input:
</p>
<div class="org-src-container">
<pre class="src src-ocaml">let parse (p : 'a parser) (s : string) =
  match p (explode s) with
  | (a, []) -&gt; Some a
  | _ -&gt; None
</pre>
</div>

<p>
A <b>parser combinator</b> is a higher-order function which can be used to
compose parsers. There is a small subset of parser combinators which
are of particular importance because they correspond to the constructs
in EBNF specifications.
</p>
<ul class="org-ul">
<li><p>
<b>Alternatives.</b> <code>p1 &lt;|&gt; p2</code> is the parser which tries running the
parser <code>p1</code>, returning its output if it succeeds, and running <code>p2</code>
otherwise.
</p>

<p>
If <code>p1</code> is a parser for the forms of a nonterminal symbol <code>&lt;p1&gt;</code>
and <code>p2</code> a parser for forms of a nonterminal symbol <code>&lt;p2&gt;</code>, then <code>p1
  &lt;|&gt; p2</code> is a parser for forms of the nonterminal symbol
</p>
<pre class="example">
&lt;alt&gt; ::= &lt;p1&gt; | &lt;p2&gt;
</pre></li>
<li><p>
<b>Sequencing.</b> <code>seq p1 p2</code> is the parser which runs both <code>p1</code> and
<code>p2</code> and returns both of their outputs if both parsers succeed.  It
fails if either <code>p1</code> or <code>p2</code> fails.
</p>

<p>
If <code>p1</code> is a parser for the forms of a nonterminal symbol <code>&lt;p1&gt;</code> and
<code>p2</code> a parser for forms of a nonterminal symbol <code>&lt;p2&gt;</code>, then <code>p1 &lt;|&gt;
  p2</code> is a parser for forms of the nonterminal symbol
</p>
<pre class="example">
&lt;seq&gt; ::= &lt;p1&gt; &lt;p2&gt;
</pre></li>
<li><p>
<b>Repetition.</b> <code>many p</code> is the parser which runs <code>p</code> repeatedly until
it fails, collecting all its outputs in a list.
</p>

<p>
If <code>p</code> is a parser for the forms of a nonterminal symbol <code>&lt;p&gt;</code> and
<code>p2</code> a parser for forms of a nonterminal symbol <code>&lt;p2&gt;</code>, then <code>many
  p</code> is a parser for forms of the nonterminal symbol
</p>
<pre class="example">
&lt;many&gt; ::= { &lt;p&gt; }
</pre></li>
</ul>

<p>
The last important combinator is <code>map</code>, which can be used to
manipulate the output of a parser without affecting how it consumes
its input.  If <code>p</code> is an <code>'a parser</code>, and <code>f</code> is a function of type
<code>'a -&gt; 'b</code>, then <code>map f p</code> is a <code>'b parser</code> which runs <code>'a</code> and then
applies <code>f</code> to its output (if it succeeds).
</p>

<p>
You should also be familiar with how to use the more convenient parser
combinators throughout the course (though, for the exam, you will not
be required to memorize their definitions).
</p>
<ul class="org-ul">
<li><code>str</code>, <code>token</code>, <code>ws</code></li>
<li>(<code>&gt;&gt;</code>), (<code>&lt;&lt;</code>), <code>seq3</code>, <code>seq4</code></li>
<li>(<code>&gt;|</code>), <code>map2</code>, <code>map3</code>, <code>map4</code></li>
<li><code>pure</code>, <code>fail</code>, (we will not test on <code>bind</code> (<code>&gt;&gt;=</code>) but it is good to know&#x2026;)</li>
</ul>
</div>
