final-review-320.org
* Formal Semantics
In general, semantics is the study of the /meaning/ of language.  We
use concepts from the study of formal semantics to model the behavior
(i.e., the meaning) of programs.

We discussed two forms of semantics, *denotational* semantics and
*operational* semantics.

Giving a denotational semantics for a programming language means
assigning to each a /mathematical function/ which has the same
input/output behavior as the program.

In this course, we focus on operational semantics.  Giving an
operational semantics for a programming language means describing how
a program in the language is evaluated.  This typically means defining
a *reduction relation* on programs, which describes how a program is
reduced until it reaches a state which cannot be further reduced.

** Derivations

Suppose we have a programming language $\mathcal P$ defined by a given BNF grammar.

A *configuration* is a pair consistent of a program $P$ and a state
$S$ which may be manipulated by programs.  The state may be empty, as
in the case of functional languages.

Defining the (small-step) operational semantics for $\mathcal P$ means
defining a reduction relation for configurations:
\begin{equation*}
( \ S \ , \ P \ ) \longrightarrow ( \ S' \ , \ P' \ )
\end{equation*}

A reduction relation is typically defined via *reduction rules*, which
consist of a /shape/ of a reduction together with a collection of
*premises*, which may be shapes of reductions or trivial premises
(also called axioms). The general form of a reduction rules is
something like
\begin{equation*}
\frac
{P_1 \qquad P_2 \qquad \dots \qquad P_k}
{C \longrightarrow C'}
\ \textsf{(name)}
\end{equation*}

/Shape/ here refers to the fact that the configurations in a reduction
rule contains /meta-variables/ that describe the /kind of reductions/
that can be derived, or that can be used a premises.  For example, the
rules for evaluating an arithmetic expression might include
\begin{equation*}
\frac{e_1 \longrightarrow e_1'}
{e_1 + e_2 \longrightarrow e_1' + e_2}
\ \textsf{(add-left)}
\end{equation*}
which expresses that if $e_1$ reduces to $e_1'$ in a single step then
$e_1 + e_2$ reduces to $e_1 + e_2'$ in a single step /no matter the
expressions $e_1$, $e_1'$ and $e_2$/.  This rule can be used to show that
\begin{equation*}
(1 + 2) + 3 \longrightarrow 3 + 3
\end{equation*}
but also that
\begin{equation*}
(1 + (2 * 3)) + 3 \longrightarrow (1 + 6) + 3
\end{equation*}
Both reductions invoke that fact that if the left argument can be
reduced by a single step, then the sum can be reduced by a single
step.

A *derivation* is, informally, a tree in which each node is a
reduction and the children of a node are the premises required to
derive that conclusion.  The leaves of a derivation are trivial
premises (axioms).

A derivation of a reduction $C \longrightarrow C'$ is a derivation
whose root is $C \longrightarrow C'$.

TODO derivation

It is generally preferable that any derivable reduction has a unique
derivation.  This defining an evaluation procedure easier, and amounts
to fixing an *evaluation order*.  We can often enforce an evaluation
order via the structure of our reduction rules.

What we have been describing is a *single-step reduction relation*.
Any single-step reduction relation can be extended to a *multi-step
reduction relation* by including the following rules and a multi-step reduction relation symbol
'$\longrightarrow^{\star}$'.
\begin{equation*}
\frac
{}
{C \longrightarrow^\star C}
\ \textsf{(refl)}
\qquad
\frac
{C \longrightarrow^\star C' \qquad C' \longrightarrow C''}
{C \longrightarrow^\star C''}
\ \textsf{(trans)}
\end{equation*}

Formally, *evaluation* is the process of determining a configuration $C'$ for a
given configuration $C$ such that $C \longrightarrow^\star C'$ and
$C'$ cannot be further reduced (i.e., there is no other configuration
$C''$ such that $C' \longrightarrow C''$).

*** Exercises
1. Write a derivation for this reduction.
2. Find a configuration which this single-step reduces to.
3. Write a derivation for this multi-step reduction.
4. Find a configuration for this multi-step reduction.
5. Show that this reduction relation is not normalizing.
6. Show that this relation is not unique.
7. Make this reduction update the above relation so that it has unique
   reductions and arguments are evaluated from left to right.
** Examples
*** Arithmetic Expressions
*** The Lambda Calculus
*** A Stack-Oriented Language
One of the running examples we used for understanding operations
semantics was stack-oriented languages.

The following is a BNF specification for a stack-oriented language
whose programs manipulate a stack of integers.
#+begin_src
  <prog>  ::= { <com> }
  <com>   ::= <num> | drop | dup | swap | .
            | + | - | *
            | then <com> else <com> end
  <num>   ::= <digit> { <digit> }
  <digit> ::= 0 | 1 | 2 | 3 | 4 | 5 | 6 | 7 | 8 | 9
#+end_src

Here, for example, is a program which determines the prints the value of $14^2 + 15^2$.
#+begin_src
  14 dup *
  15 dup *
  + .
#+end_src
In the operational semantics of this language we take a configuration
to be a program ($P$) together with a stack of integers ($S$) and a trace of
strings ($T$) that are printed throughout the evaluation of the program.
\begin{equation*}
( \ S \ , \ T \ , \ P \ )
\end{equation*}
with a special error configuration
\begin{equation*}
\mathsf{ERROR} \equiv ( \ \varnothing \ , \ \textsf{panic} :: \varnothing \ , \ \epsilon \ )
\end{equation*}

The operational semantics then describe how each command affects the stack and the trace.

TODO
*** Exercises
TODO
* Subroutines
** Parameter Passing
** Examples
*** Lambda Calculus with Call-by-Name Operational Semantics
*** Lambda Calculus with Call-by-Value Operational Semantics
*** Stack-Oriented Language with Subroutines
* Environments
We need to specify how those variable bindings are represented in a
configuration.

When introducing variables to a programming language, we have to
specify when/where those bindings are accessible. This is called the
*scope* of the binding.  In general, this is a complex question, but
is broad strokes there are two paradigms: *dynamic scoping* and
*lexical scoping*.
** Stack-Oriented Language with Variables
