final-review-320.html


<div id="outline-container-org0218e89" class="outline-4">
<h4 id="org0218e89">Exercises</h4>
</div>
</div>
</div>
<div id="outline-container-orga0ae140" class="outline-2">
<h2 id="orga0ae140">Formal Semantics</h2>
<div class="outline-text-2" id="text-orga0ae140">
<p>
In general, semantics is the study of the <i>meaning</i> of language.  We
use concepts from the study of formal semantics to model the behavior
(i.e., the meaning) of programs.
</p>

<p>
We discussed two forms of semantics, <b>denotational</b> semantics and
<b>operational</b> semantics.
</p>

<p>
Giving a denotational semantics for a programming language means
assigning to each a <i>mathematical function</i> which has the same
input/output behavior as the program.
</p>

<p>
In this course, we focus on operational semantics.  Giving an
operational semantics for a programming language means describing how
a program in the language is evaluated.  This typically means defining
a <b>reduction relation</b> on programs, which describes how a program is
reduced until it reaches a state which cannot be further reduced.
</p>
</div>

<div id="outline-container-org86d466c" class="outline-3">
<h3 id="org86d466c">Derivations</h3>
<div class="outline-text-3" id="text-org86d466c">
<p>
Suppose we have a programming language \(\mathcal P\) defined by a given BNF grammar.
</p>

<p>
A <b>configuration</b> is a pair consistent of a program \(P\) and a state
\(S\) which may be manipulated by programs.  The state may be empty, as
in the case of functional languages.
</p>

<p>
Defining the (small-step) operational semantics for \(\mathcal P\) means
defining a reduction relation for configurations:
</p>
\begin{equation*}
( \ S \ , \ P \ ) \longrightarrow ( \ S' \ , \ P' \ )
\end{equation*}

<p>
A reduction relation is typically defined via <b>reduction rules</b>, which
consist of a <i>shape</i> of a reduction together with a collection of
<b>premises</b>, which may be shapes of reductions or trivial premises
(also called axioms). The general form of a reduction rules is
something like
</p>
\begin{equation*}
\frac
{P_1 \qquad P_2 \qquad \dots \qquad P_k}
{C \longrightarrow C'}
\ \textsf{(name)}
\end{equation*}

<p>
<i>Shape</i> here refers to the fact that the configurations in a reduction
rule contains <i>meta-variables</i> that describe the <i>kind of reductions</i>
that can be derived, or that can be used a premises.  For example, the
rules for evaluating an arithmetic expression might include
</p>
\begin{equation*}
\frac{e_1 \longrightarrow e_1'}
{e_1 + e_2 \longrightarrow e_1' + e_2}
\ \textsf{(add-left)}
\end{equation*}
<p>
which expresses that if \(e_1\) reduces to \(e_1'\) in a single step then
\(e_1 + e_2\) reduces to \(e_1 + e_2'\) in a single step <i>no matter the
expressions \(e_1\), \(e_1'\) and \(e_2\)</i>.  This rule can be used to show that
</p>
\begin{equation*}
(1 + 2) + 3 \longrightarrow 3 + 3
\end{equation*}
<p>
but also that
</p>
\begin{equation*}
(1 + (2 * 3)) + 3 \longrightarrow (1 + 6) + 3
\end{equation*}
<p>
Both reductions invoke that fact that if the left argument can be
reduced by a single step, then the sum can be reduced by a single
step.
</p>

<p>
A <b>derivation</b> is, informally, a tree in which each node is a
reduction and the children of a node are the premises required to
derive that conclusion.  The leaves of a derivation are trivial
premises (axioms).
</p>

<p>
A derivation of a reduction \(C \longrightarrow C'\) is a derivation
whose root is \(C \longrightarrow C'\).
</p>

<p>
TODO derivation
</p>

<p>
It is generally preferable that any derivable reduction has a unique
derivation.  This defining an evaluation procedure easier, and amounts
to fixing an <b>evaluation order</b>.  We can often enforce an evaluation
order via the structure of our reduction rules.
</p>

<p>
What we have been describing is a <b>single-step reduction relation</b>.
Any single-step reduction relation can be extended to a <b>multi-step
reduction relation</b> by including the following rules and a multi-step reduction relation symbol
'\(\longrightarrow^{\star}\)'.
</p>
\begin{equation*}
\frac
{}
{C \longrightarrow^\star C}
\ \textsf{(refl)}
\qquad
\frac
{C \longrightarrow^\star C' \qquad C' \longrightarrow C''}
{C \longrightarrow^\star C''}
\ \textsf{(trans)}
\end{equation*}

<p>
Formally, <b>evaluation</b> is the process of determining a configuration \(C'\) for a
given configuration \(C\) such that \(C \longrightarrow^\star C'\) and
\(C'\) cannot be further reduced (i.e., there is no other configuration
\(C''\) such that \(C' \longrightarrow C''\)).
</p>
</div>

<div id="outline-container-org638c6ba" class="outline-4">
<h4 id="org638c6ba">Exercises</h4>
<div class="outline-text-4" id="text-org638c6ba">
<ol class="org-ol">
<li>Write a derivation for this reduction.</li>
<li>Find a configuration which this single-step reduces to.</li>
<li>Write a derivation for this multi-step reduction.</li>
<li>Find a configuration for this multi-step reduction.</li>
<li>Show that this reduction relation is not normalizing.</li>
<li>Show that this relation is not unique.</li>
<li>Make this reduction update the above relation so that it has unique
reductions and arguments are evaluated from left to right.</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orgc963db8" class="outline-3">
<h3 id="orgc963db8">Examples</h3>
<div class="outline-text-3" id="text-orgc963db8">
</div>
<div id="outline-container-org0a342ac" class="outline-4">
<h4 id="org0a342ac">Arithmetic Expressions</h4>
</div>
<div id="outline-container-org1bc4654" class="outline-4">
<h4 id="org1bc4654">The Lambda Calculus</h4>
</div>
<div id="outline-container-orgecfa776" class="outline-4">
<h4 id="orgecfa776">A Stack-Oriented Language</h4>
<div class="outline-text-4" id="text-orgecfa776">
<p>
One of the running examples we used for understanding operations
semantics was stack-oriented languages.
</p>

<p>
The following is a BNF specification for a stack-oriented language
whose programs manipulate a stack of integers.
</p>
<pre class="example">
&lt;prog&gt;  ::= { &lt;com&gt; }
&lt;com&gt;   ::= &lt;num&gt; | drop | dup | swap | .
          | + | - | *
          | then &lt;com&gt; else &lt;com&gt; end
&lt;num&gt;   ::= &lt;digit&gt; { &lt;digit&gt; }
&lt;digit&gt; ::= 0 | 1 | 2 | 3 | 4 | 5 | 6 | 7 | 8 | 9
</pre>

<p>
Here, for example, is a program which determines the prints the value of \(14^2 + 15^2\).
</p>
<pre class="example">
14 dup *
15 dup *
+ .
</pre>
<p>
In the operational semantics of this language we take a configuration
to be a program (\(P\)) together with a stack of integers (\(S\)) and a trace of
strings (\(T\)) that are printed throughout the evaluation of the program.
</p>
\begin{equation*}
( \ S \ , \ T \ , \ P \ )
\end{equation*}
<p>
with a special error configuration
</p>
\begin{equation*}
\mathsf{ERROR} \equiv ( \ \varnothing \ , \ \textsf{panic} :: \varnothing \ , \ \epsilon \ )
\end{equation*}

<p>
The operational semantics then describe how each command affects the stack and the trace.
</p>

<p>
TODO
</p>
</div>
</div>
<div id="outline-container-org1767273" class="outline-4">
<h4 id="org1767273">Exercises</h4>
<div class="outline-text-4" id="text-org1767273">
<p>
TODO
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-orgd08fbca" class="outline-2">
<h2 id="orgd08fbca">Subroutines</h2>
<div class="outline-text-2" id="text-orgd08fbca">
</div>
<div id="outline-container-org599e14b" class="outline-3">
<h3 id="org599e14b">Parameter Passing</h3>
</div>
<div id="outline-container-org186cdf4" class="outline-3">
<h3 id="org186cdf4">Examples</h3>
<div class="outline-text-3" id="text-org186cdf4">
</div>
<div id="outline-container-org02aa012" class="outline-4">
<h4 id="org02aa012">Lambda Calculus with Call-by-Name Operational Semantics</h4>
</div>
<div id="outline-container-org0f59e61" class="outline-4">
<h4 id="org0f59e61">Lambda Calculus with Call-by-Value Operational Semantics</h4>
</div>
<div id="outline-container-org90cc27f" class="outline-4">
<h4 id="org90cc27f">Stack-Oriented Language with Subroutines</h4>
</div>
</div>
</div>
<div id="outline-container-org2552d76" class="outline-2">
<h2 id="org2552d76">Environments</h2>
<div class="outline-text-2" id="text-org2552d76">
<p>
We need to specify how those variable bindings are represented in a
configuration.
</p>

<p>
When introducing variables to a programming language, we have to
specify when/where those bindings are accessible. This is called the
<b>scope</b> of the binding.  In general, this is a complex question, but
is broad strokes there are two paradigms: <b>dynamic scoping</b> and
<b>lexical scoping</b>.
</p>
</div>
<div id="outline-container-org97147b3" class="outline-3">
<h3 id="org97147b3">Stack-Oriented Language with Variables</h3>
</div>
</div>
