final-review-320.org
* Dynamic Scoping
Dynamic scoping refers to the idea of using /computational (temporal)
context/ to determine when a binding is available.  In its simplest
form, we may think of all bindings as globally available as soon as
they have been instantiated.

In a language with dynamic scoping and /subroutines/, when it comes to
determining what bindings are available, it doesn't matter where a
subroutine is defined, but rather where it is called.

Bash is a widely used language with dynamic scoping, but in general,
dynamic scoping is not common in modern programming languages.  It is,
however, much easier to implement than lexical scoping.
** Stack-Oriented Language with Dynamic Scoping
* Lexical Scoping
** Activation Records
*** Stack-Oriented Language with Mutable Variables and Lexical Scoping
** Closures
*** Stack-Oriented Language with Immutable Variables and Lexical Scoping
* Compilation
* Solutions to Exercises
