final-review-320.html
<div id="outline-container-orge83cf98" class="outline-2">
<h2 id="orge83cf98">Dynamic Scoping</h2>
<div class="outline-text-2" id="text-orge83cf98">
<p>
Dynamic scoping refers to the idea of using <i>computational (temporal)
context</i> to determine when a binding is available.  In its simplest
form, we may think of all bindings as globally available as soon as
they have been instantiated.
</p>

<p>
In a language with dynamic scoping and <i>subroutines</i>, when it comes to
determining what bindings are available, it doesn't matter where a
subroutine is defined, but rather where it is called.
</p>

<p>
Bash is a widely used language with dynamic scoping, but in general,
dynamic scoping is not common in modern programming languages.  It is,
however, much easier to implement than lexical scoping.
</p>
</div>
<div id="outline-container-org629ca0b" class="outline-3">
<h3 id="org629ca0b">Stack-Oriented Language with Dynamic Scoping</h3>
</div>
</div>
<div id="outline-container-orgbc1fe25" class="outline-2">
<h2 id="orgbc1fe25">Lexical Scoping</h2>
<div class="outline-text-2" id="text-orgbc1fe25">
</div>
<div id="outline-container-orgf4a1425" class="outline-3">
<h3 id="orgf4a1425">Activation Records</h3>
<div class="outline-text-3" id="text-orgf4a1425">
</div>
<div id="outline-container-org7384464" class="outline-4">
<h4 id="org7384464">Stack-Oriented Language with Mutable Variables and Lexical Scoping</h4>
</div>
</div>
<div id="outline-container-org6e9edfe" class="outline-3">
<h3 id="org6e9edfe">Closures</h3>
<div class="outline-text-3" id="text-org6e9edfe">
</div>
<div id="outline-container-orgc60e210" class="outline-4">
<h4 id="orgc60e210">Stack-Oriented Language with Immutable Variables and Lexical Scoping</h4>
</div>
</div>
</div>
<div id="outline-container-org6047722" class="outline-2">
<h2 id="org6047722">Compilation</h2>
</div>
<div id="outline-container-org54d3a2a" class="outline-2">
<h2 id="org54d3a2a">Solutions to Exercises</h2>
</div>
</div>
</body>
</html>
